# Напишите программу, которая определяет наименьшее из двух чисел

a, b = int(input()), int(input())

if a < b:
    print(a)
else:
    print(b)