# Напишите программу вывода на экран трех последовательно идущих чисел,
# каждое на отдельной строке. Первое число вводит пользователь,
# остальные числа вычисляются в программе.

first_num = int(input())
print(first_num)
first_num += 1
print(first_num)
first_num += 1
print(first_num)