# Напишите программу, которая приветствует пользователя,
# выводя слово «Привет» (без кавычек), после которого должна стоять
# запятая и пробел,
# а затем введенное имя и восклицательный знак.  

print('Привет', input(), sep=', ', end='!\n')
