# На вход программе подается натуральное число n. Напишите
# программу, которая печатает звездную рамку размерами n×19.
# Sample Input 1:
# 3
# Sample Output 1:
# *******************
# *                 *
# *******************

n = int(input())
COUNT = 19
for i in range(n):
    if i == 0 or i == n - 1:
        print('*' * COUNT)
    else:
        print('*', ' ' * (COUNT - 2), '*', sep='')
