# На вход программе подается строка текста и строка разделитель.
# Напишите программу, которая вставляет указанный разделитель между
# каждым символом введенной строки текста.

str = list(input())
sprt = input()
print(sprt.join(str))