# Напишите функцию draw_box(), которая выводит звездный прямоугольник с
# размерами 14×10 в соответствии с образцом:

# **********
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# *        *
# **********


def draw_box():
    print('*' * 10)
    for _ in range(14 - 2):
        print('*' + ' ' * 8 + '*', sep='')
    print('*' * 10)

draw_box()