# На вход программе подается строка текста. Напишите программу, 
# которая определяет количество различных символов в строке.

print(len(set(input())))