# Напишите программу, которая находит полное число
# метров по заданному числу сантиметров.

sntm = int(input())
print(sntm // 100)