# Дано положительное действительное число. Выведите его дробную часть.

num = float(input())
print(num - int(num))