# Напишите программу, которая считывает строку-разделитель и три
# строки, а затем выводит указанные строки через разделитель.

my_sep = input()
print(input(), input(), input(), sep=my_sep)