# На вход программе подается строка текста. Напишите программу,
# которая удаляет все вхождения символа «@».

s = input()
print(s.replace('@', ''))