# Напишите программу, которая выводит прямоугольник,
# по периметру состоящий из звездочек (*).

# Sample Input:

# Sample Output:

# *****************
# *               *
# *               *
# *****************

print('*' * 17)
print('*', ' ' * 15, '*', sep='')
print('*', ' ' * 15, '*', sep='')
print('*' * 17)
