# Напишите программу, которая считывает три строки по очереди, а
# затем выводит их в обратной
# последовательности, каждую на отдельной строчке.

# Формат входных данных
# На вход программе подается три строки, каждая на отдельной строке.

# Формат выходных данных
# Программа должна вывести введенные строки в обратной
# последовательности, каждую на отдельной строке.

var1 = input()
var2 = input()
var3 = input()
print(var3)
print(var2)
print(var1)